       IDENTIFICATION DIVISION.
       PROCEDURE DIVISION.
         CALL "ALLOWED37" USING PARAM1.
         CALL "FORBIDDEN41".
         CALL "FORBIDDEN42" USING PARAM1.
         CALL UNKNOWN-PROGRAM.
         DISPLAY "FORBIDDEN42".
