       IDENTIFICATION DIVISION.                                                           
       PROGRAM-ID. enq200.                                                    
       ENVIRONMENT DIVISION.                                                  
       DATA DIVISION.                                                                                                                
       PROCEDURE DIVISION.      
       PARAGRAPH.                                                                                                                       
             IF ABT-IN-PROGRESS = 'N'
                     NEXT SENTENCE
             END-IF.